In [ ]:
# Task (3)
# Using SQLite Fror the database

In [24]:
import sqlite3

connection = sqlite3.connect("MyDatabase.db")

In [25]:
print(connection.total_changes)

0

In [26]:
cursor = connection.cursor()
cursor.execute("CREATE TABLE Worker (ID INT PRIMARY KEY, FIRST_NAME TEXT, LAST_NAME TEXT,DEPARTMENT TEXT,  MANAGER TEXT , SALARY INT , COMPLETE_NAME TEXT ,join_date TEXT)")

In [27]:
cursor.execute("INSERT INTO Worker VALUES (1,'Amitabh','Kochhar','ICT','yes',200000 , '', '2014-02-12')")
cursor.execute("INSERT INTO Worker VALUES (2,'Vipul','King','Admin','yes',150000, '', '2014-05-12')")
cursor.execute("INSERT INTO Worker VALUES (3,'Satish','Ernst','IT','no',300000, '', '2015-02-12')")
cursor.execute("INSERT INTO Worker VALUES (4,'Rania','Alageel','ICT','yes',400000, '', '2019-05-17')")
cursor.execute("INSERT INTO Worker VALUES (5,'Alexander','Hunold','Admin','yes',240000, '', '2014-02-22')")
cursor.execute("INSERT INTO Worker VALUES (6,'Bruce','Ernst','IT','no',290000, '', '2013-02-10')")
cursor.execute("INSERT INTO Worker VALUES (7,'David','Austin','ICT','no',210000, '', '2019-01-18')")
cursor.execute("INSERT INTO Worker VALUES (8,'Diana','Lorentz','stratigy','yes',200000, '', '2017-04-16')")
cursor.execute("INSERT INTO Worker VALUES (9,'Nancy','Greenberg','IT','no',900000, '', '2014-02-16')")
cursor.execute("INSERT INTO Worker VALUES (10,'Daniel','Faviet','ICT','no',10000, '', '2014-08-30')")
cursor.execute("INSERT INTO Worker VALUES (11,'John','Chen','ICT','no',240000, '', '2012-06-18')")
cursor.execute("INSERT INTO Worker VALUES (12,'Alexander','Khoo','Security','yes',500000, '', '2017-04-19')")
cursor.execute("INSERT INTO Worker VALUES (13,'Kevin','Mourgos','ICT','no',100000, '', '2014-02-01')")
cursor.execute("INSERT INTO Worker VALUES (14,'Steven','Markle','ICT','no',150000, '', '2014-08-12')")
cursor.execute("INSERT INTO Worker VALUES (15,'Steven','Markle','ICT','no',150000, '', '2014-08-12')")

In [28]:
# Q (1) Write an SQL query to fetch "FIRST NAME" from the Worker table in upper case
rows = cursor.execute("SELECT UPPER(FIRST_NAME) FROM Worker").fetchall()
print(rows)

[('AMITABH',), ('VIPUL',), ('SATISH',), ('RANIA',), ('ALEXANDER',), ('BRUCE',), ('DAVID',), ('DIANA',), ('NANCY',), ('DANIEL',), ('JOHN',), ('ALEXANDER',), ('KEVIN',), ('STEVEN',), ('STEVEN',)]

In [29]:
# Q (2) Write an SQL query to fetch unique values of DEPARTMENT from the Worker table
rows = cursor.execute("SELECT distinct DEPARTMENT FROM Worker").fetchall()
print(rows)

[('ICT',), ('Admin',), ('IT',), ('stratigy',), ('Security',)]

In [30]:
# Q (3) Write an SQL query to print the first three characters of FIRST NAME from the Worker table
rows = cursor.execute("SELECT SUBSTRING(FIRST_NAME, 1, 3) FROM Worker").fetchall()
print(rows)

[('Ami',), ('Vip',), ('Sat',), ('Ran',), ('Ale',), ('Bru',), ('Dav',), ('Dia',), ('Nan',), ('Dan',), ('Joh',), ('Ale',), ('Kev',), ('Ste',), ('Ste',)]

In [31]:
# Q (4) Write an SQL query to find the position of the alphabet ('a') in the first name column Amitabh' from the Worker table
rows = cursor.execute("SELECT INSTR(FIRST_NAME, 'A') FROM Worker WHERE FIRST_NAME = 'Amitabh'").fetchall()
print(rows)

[(1,)]

In [32]:
# Q (5) Write an SQL query to print the FIRST_NAME from the Worker table after removing white spaces from the right side
rows = cursor.execute("SELECT RTRIM(FIRST_NAME) FROM Worker").fetchall()
print(rows)

[('Amitabh',), ('Vipul',), ('Satish',), ('Rania',), ('Alexander',), ('Bruce',), ('David',), ('Diana',), ('Nancy',), ('Daniel',), ('John',), ('Alexander',), ('Kevin',), ('Steven',), ('Steven',)]

In [33]:
# Q (6) Write an SQL query that fetches the unique values of DEPARTMENT from the Worker table and prints its length
rows = cursor.execute("SELECT LTRIM(DEPARTMENT) FROM Worker").fetchall()
print(rows)

[('ICT',), ('Admin',), ('IT',), ('ICT',), ('Admin',), ('IT',), ('ICT',), ('stratigy',), ('IT',), ('ICT',), ('ICT',), ('Security',), ('ICT',), ('ICT',), ('ICT',)]

In [34]:
# Q (7) Write an SQL query to print the FIRST NAME from the Worker table after replacing 'a' with 'A'
rows = cursor.execute("SELECT REPLACE(FIRST_NAME, 'a', 'A') FROM Worker").fetchall()
print(rows)

[('AmitAbh',), ('Vipul',), ('SAtish',), ('RAniA',), ('AlexAnder',), ('Bruce',), ('DAvid',), ('DiAnA',), ('NAncy',), ('DAniel',), ('John',), ('AlexAnder',), ('Kevin',), ('Steven',), ('Steven',)]

In [35]:
# Q (8) Write an SQL query to print the FIRST NAME and LAST NAME from the Worker table into a single column COMPLETE NAME. A space char should separate them
rows = cursor.execute("SELECT COMPLETE_NAME || FIRST_NAME || ' ' || LAST_NAME FROM Worker").fetchall()
print(rows)

[('Amitabh Kochhar',), ('Vipul King',), ('Satish Ernst',), ('Rania Alageel',), ('Alexander Hunold',), ('Bruce Ernst',), ('David Austin',), ('Diana Lorentz',), ('Nancy Greenberg',), ('Daniel Faviet',), ('John Chen',), ('Alexander Khoo',), ('Kevin Mourgos',), ('Steven Markle',), ('Steven Markle',)]

In [36]:
# Q (9) Write an SQL query to print all Worker details from the Worker table order by FIRST_ NAME Ascending and DEPARTMENT Descending
rows = cursor.execute("SELECT * FROM Worker ORDER BY FIRST_NAME ASC, DEPARTMENT DESC").fetchall()
print(rows)

[(12, 'Alexander', 'Khoo', 'Security', 'yes', 500000, '', '2017-04-19'), (5, 'Alexander', 'Hunold', 'Admin', 'yes', 240000, '', '2014-02-22'), (1, 'Amitabh', 'Kochhar', 'ICT', 'yes', 200000, '', '2014-02-12'), (6, 'Bruce', 'Ernst', 'IT', 'no', 290000, '', '2013-02-10'), (10, 'Daniel', 'Faviet', 'ICT', 'no', 10000, '', '2014-08-30'), (7, 'David', 'Austin', 'ICT', 'no', 210000, '', '2019-01-18'), (8, 'Diana', 'Lorentz', 'stratigy', 'yes', 200000, '', '2017-04-16'), (11, 'John', 'Chen', 'ICT', 'no', 240000, '', '2012-06-18'), (13, 'Kevin', 'Mourgos', 'ICT', 'no', 100000, '', '2014-02-01'), (9, 'Nancy', 'Greenberg', 'IT', 'no', 900000, '', '2014-02-16'), (4, 'Rania', 'Alageel', 'ICT', 'yes', 400000, '', '2019-05-17'), (3, 'Satish', 'Ernst', 'IT', 'no', 300000, '', '2015-02-12'), (14, 'Steven', 'Markle', 'ICT', 'no', 150000, '', '2014-08-12'), (15, 'Steven', 'Markle', 'ICT', 'no', 150000, '', '2011-06-11'), (2, 'Vipul', 'King', 'Admin', 'yes', 150000, '', '2014-05-12')]

In [37]:
# Q (10) Write an SQL query to print details of workers excluding first names, "Vipul" and "Satish" from the Worker table
rows = cursor.execute("SELECT * FROM Worker WHERE FIRST_NAME NOT IN ('Vipul', 'Satish')").fetchall()
print(rows)

[(1, 'Amitabh', 'Kochhar', 'ICT', 'yes', 200000, '', '2014-02-12'), (4, 'Rania', 'Alageel', 'ICT', 'yes', 400000, '', '2019-05-17'), (5, 'Alexander', 'Hunold', 'Admin', 'yes', 240000, '', '2014-02-22'), (6, 'Bruce', 'Ernst', 'IT', 'no', 290000, '', '2013-02-10'), (7, 'David', 'Austin', 'ICT', 'no', 210000, '', '2019-01-18'), (8, 'Diana', 'Lorentz', 'stratigy', 'yes', 200000, '', '2017-04-16'), (9, 'Nancy', 'Greenberg', 'IT', 'no', 900000, '', '2014-02-16'), (10, 'Daniel', 'Faviet', 'ICT', 'no', 10000, '', '2014-08-30'), (11, 'John', 'Chen', 'ICT', 'no', 240000, '', '2012-06-18'), (12, 'Alexander', 'Khoo', 'Security', 'yes', 500000, '', '2017-04-19'), (13, 'Kevin', 'Mourgos', 'ICT', 'no', 100000, '', '2014-02-01'), (14, 'Steven', 'Markle', 'ICT', 'no', 150000, '', '2014-08-12'), (15, 'Steven', 'Markle', 'ICT', 'no', 150000, '', '2011-06-11')]

In [38]:
# Q (11) Write an SOL query to print details of Workers with DEPARTMENT name as "Admin"
rows = cursor.execute("SELECT * FROM Worker WHERE DEPARTMENT = 'Admin'").fetchall()
print(rows)

[(2, 'Vipul', 'King', 'Admin', 'yes', 150000, '', '2014-05-12'), (5, 'Alexander', 'Hunold', 'Admin', 'yes', 240000, '', '2014-02-22')]

In [39]:
# Q (12) Write an SQL query to print details of the Workers whose FIRST NAME contains 'a'
rows = cursor.execute("SELECT * FROM Worker WHERE FIRST_NAME LIKE '%a%'").fetchall()
print(rows)

[(1, 'Amitabh', 'Kochhar', 'ICT', 'yes', 200000, '', '2014-02-12'), (3, 'Satish', 'Ernst', 'IT', 'no', 300000, '', '2015-02-12'), (4, 'Rania', 'Alageel', 'ICT', 'yes', 400000, '', '2019-05-17'), (5, 'Alexander', 'Hunold', 'Admin', 'yes', 240000, '', '2014-02-22'), (7, 'David', 'Austin', 'ICT', 'no', 210000, '', '2019-01-18'), (8, 'Diana', 'Lorentz', 'stratigy', 'yes', 200000, '', '2017-04-16'), (9, 'Nancy', 'Greenberg', 'IT', 'no', 900000, '', '2014-02-16'), (10, 'Daniel', 'Faviet', 'ICT', 'no', 10000, '', '2014-08-30'), (12, 'Alexander', 'Khoo', 'Security', 'yes', 500000, '', '2017-04-19')]

In [40]:
# Q (13) Write an SQL query to print details of the Workers whose FIRST NAME ends with 'h' and contains six alphabets
rows = cursor.execute("SELECT * FROM Worker WHERE FIRST_NAME LIKE '%h'").fetchall()
print(rows)

[(1, 'Amitabh', 'Kochhar', 'ICT', 'yes', 200000, '', '2014-02-12'), (3, 'Satish', 'Ernst', 'IT', 'no', 300000, '', '2015-02-12')]

In [59]:
# Q (14) Write an SQL query to print details of the Workers Whose SALARY lies detween 100000 and 500000
rows = cursor.execute("SELECT * FROM Worker WHERE SALARY BETWEEN 100000 AND 500000").fetchall()
print(rows)

[(1, 'Amitabh', 'Kochhar', 'ICT', 'yes', 200000, '', '2014-02-12'), (2, 'Vipul', 'King', 'Admin', 'yes', 150000, '', '2014-05-12'), (3, 'Satish', 'Ernst', 'IT', 'no', 300000, '', '2015-02-12'), (4, 'Rania', 'Alageel', 'ICT', 'yes', 400000, '', '2019-05-17'), (5, 'Alexander', 'Hunold', 'Admin', 'yes', 240000, '', '2014-02-22'), (6, 'Bruce', 'Ernst', 'IT', 'no', 290000, '', '2013-02-10'), (7, 'David', 'Austin', 'ICT', 'no', 210000, '', '2019-01-18'), (8, 'Diana', 'Lorentz', 'stratigy', 'yes', 200000, '', '2017-04-16'), (11, 'John', 'Chen', 'ICT', 'no', 240000, '', '2012-06-18'), (12, 'Alexander', 'Khoo', 'Security', 'yes', 500000, '', '2017-04-19'), (13, 'Kevin', 'Mourgos', 'ICT', 'no', 100000, '', '2014-02-01'), (14, 'Steven', 'Markle', 'ICT', 'no', 150000, '', '2014-08-12'), (15, 'Steven', 'Markle', 'ICT', 'no', 150000, '', '2011-06-11')]

In [42]:
# Q (15) Write an SQL query to print details of the Workers who joined in Feb'2014
rows = cursor.execute("SELECT * FROM Worker WHERE join_date LIKE '2014-02%'").fetchall()
print(rows)

[(1, 'Amitabh', 'Kochhar', 'ICT', 'yes', 200000, '', '2014-02-12'), (5, 'Alexander', 'Hunold', 'Admin', 'yes', 240000, '', '2014-02-22'), (9, 'Nancy', 'Greenberg', 'IT', 'no', 900000, '', '2014-02-16'), (13, 'Kevin', 'Mourgos', 'ICT', 'no', 100000, '', '2014-02-01')]

In [43]:
# Q (16) Write an SQL query to fetch worker names with salaries >= 50000 and <= 100000
rows = cursor.execute("SELECT * FROM Worker WHERE salary BETWEEN 50000 AND 100000").fetchall()
print(rows)

[(13, 'Kevin', 'Mourgos', 'ICT', 'no', 100000, '', '2014-02-01')]

In [44]:
# Q (17) Write an SQL query to print details of the Workers who are also Managers
rows = cursor.execute("SELECT * FROM Worker WHERE MANAGER = 'yes'").fetchall()
print(rows)

[(1, 'Amitabh', 'Kochhar', 'ICT', 'yes', 200000, '', '2014-02-12'), (2, 'Vipul', 'King', 'Admin', 'yes', 150000, '', '2014-05-12'), (4, 'Rania', 'Alageel', 'ICT', 'yes', 400000, '', '2019-05-17'), (5, 'Alexander', 'Hunold', 'Admin', 'yes', 240000, '', '2014-02-22'), (8, 'Diana', 'Lorentz', 'stratigy', 'yes', 200000, '', '2017-04-16'), (12, 'Alexander', 'Khoo', 'Security', 'yes', 500000, '', '2017-04-19')]

In [58]:
# Q (18) Write an SQL query to fetch duplicate records having matching data in some fields of a table
rows = cursor.execute("SELECT FIRST_NAME, LAST_NAME, COUNT(*) FROM Worker GROUP BY FIRST_NAME, LAST_NAME HAVING COUNT(*) > 1").fetchall()
print(rows)

[('Steven', 'Markle', 2)]

In [61]:
# Q (19) Write an SQL query to show the top n (say 10) records of a table
rows = cursor.execute("SELECT * FROM Worker ORDER BY ID ASC LIMIT 10").fetchall()
print(rows)

[(1, 'Amitabh', 'Kochhar', 'ICT', 'yes', 200000, '', '2014-02-12'), (2, 'Vipul', 'King', 'Admin', 'yes', 150000, '', '2014-05-12'), (3, 'Satish', 'Ernst', 'IT', 'no', 300000, '', '2015-02-12'), (4, 'Rania', 'Alageel', 'ICT', 'yes', 400000, '', '2019-05-17'), (5, 'Alexander', 'Hunold', 'Admin', 'yes', 240000, '', '2014-02-22'), (6, 'Bruce', 'Ernst', 'IT', 'no', 290000, '', '2013-02-10'), (7, 'David', 'Austin', 'ICT', 'no', 210000, '', '2019-01-18'), (8, 'Diana', 'Lorentz', 'stratigy', 'yes', 200000, '', '2017-04-16'), (9, 'Nancy', 'Greenberg', 'IT', 'no', 900000, '', '2014-02-16'), (10, 'Daniel', 'Faviet', 'ICT', 'no', 10000, '', '2014-08-30')]

In [57]:
# Q (20) Write an SQL query to determine the nth (say n=5) highest salary from a table
rows = cursor.execute("SELECT * FROM (SELECT e.*, ROW_NUMBER() OVER (ORDER BY SALARY DESC) rn FROM Worker e)WHERE rn = 5; ").fetchall()
print(rows)

[(6, 'Bruce', 'Ernst', 'IT', 'no', 290000, '', '2013-02-10', 5)]

In [62]:
from contextlib import closing

with closing(sqlite3.connect("MyDatabase.db")) as connection:
    with closing(connection.cursor()) as cursor:
        rows = cursor.execute("SELECT 1").fetchall()
        print(rows)

[(1,)]